# 命令补全增强
zsh-users/zsh-completions

# 命令建议
zsh-users/zsh-autosuggestions

# 历史记录增强
zsh-users/zsh-history-substring-search

# Git 命令增强
ohmyzsh/ohmyzsh path:plugins/git

# 命令别名提醒
MichaelAquilina/zsh-you-should-use

# 快速复制路径/命令
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/copypath
# copybuffer会添加ctrl+o快捷键，将当前终端输入的命令复制到剪切板
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/z

# 快速添加 sudo（按2次Esc）
ohmyzsh/ohmyzsh path:plugins/sudo

# 命令高亮
zsh-users/zsh-syntax-highlighting